[
  {
    "short_name": "Book Meta Data",
    "ID": "Meta",

    "text_array": [
      true,
      "This room holds the metadata for the book Citadel of Chaos.",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "FF02 - THE CITADEL OF CHAOS INTRO",
    "ID": 0,
    "text_array": [
      true,
      "<span class='sectionHeader'>HOW TO FIGHT CREATURES WITHIN THE CITADEL</span> ",
      false,
      "</br>",
      false,
      "</br>",
      true,
      "You are the star pupil of the Grand Wizard of Yore, You have a knowledge of magic which is not perfect, but with a  little luck will be adequate for this quest. You also have in your possession a sword and you are well practiced in swordplay. You are quite fit and you have been exercising to build up your stamina.",
      false,
      "</br>",
      true,
      "As in The Warlock of Firetop Mountain, you must first determine your own strengths and weaknesses before setting off. Readers of The Warlock of Firetop Mountain will be familiar with most of the following rules, but are advised to skim through them as there are several points where the two books differ because of the use of magic in The Citadel of Chaos.",
      false,
      "</br>",
      true,
      "First of all, you must use the dice to determine your initial, <span class='gameStats'>SKILL</span> and <span class='gameStats'>STAMINA</span> scores. On pages 20-21 there is an Adventure Sheet which you mav use to record the details of an adventure. On it you will  find boxes for recording your <span class='gameStats'>SKILL</span> and <span class='gameStats'>STAMINA</span> scores.",
      false,
      "</br>",
      false,
      "</br>",
      true,
      "<span class='subsectionHeader'>Skill, Stamina and Luck</span>",
      false,
      "</br>",
      true,
      "Roll one die. Add 6 to this number and enter this total in the <span class='gameStats'>SKILL</span> box on the *Adventure Sheet*.",
      false,
      "</br>",
      true,
      "Roll both dice. Add 12 lo the number rolled and enter this total in the <span class='gameStats'>STAMINA</span> box.",
      false,
      "</br>",
      true,
      "There is also a <span class='gameStats'>LUCK</span> box. Roll one die, add 6 to this number and enter this total in the <span class='gameStats'>LUCK</span> box.",
      false,
      "</br>",
      true,
      "For reasons that will be explained below, <span class='gameStats'>SKILL</span>, <span class='gameStats'>STAMINA</span> and <span class='gameStats'>LUCK</span> scores change constantly during an adventure. You must keep an accurate record of these scores and for this reason vou are advised to either to write small in the boxes or to keep an eraser handy. But never rub out your <span class='gameStatsInitial'>Initial</span> scores. Although you may be awarded additional <span class='gameStats'>SKILL</span>, <span class='gameStats'>STAMINA</span> and <span class='gameStats'>LUCK</span> points, these totals may never exceed your *Initial* scores, except on very rare occasions, when you will be instructed on a particular page.",
      false,
      "</br>",
      true,
      "Your <span class='gameStats'>SKILL</span> score reflects your swordsmanship and general fighting expertise; the higher the better. Your <span class='gameStats'>STAMINA</span> score reflects your general constitution, your will to survive, your determination and overall fitness; the higher your <span class='gameStats'>STAMINA</span> score, the longer you will be able to survive. Your <span class='gameStats'>LUCK</span> score indicates how naturally lucky a person you are. Luck — and magic — are facts of life in the fantasy kingdom you are about to explore.",
      false,
      "</br>",
      false,
      "</br>",
      true,
      "Battles",
      false,
      "</br>",
      true,
      "You will often come across pages in the book which instruct you to fight a creature of some sort. An option to flee or use magic spells may be given, but if not -- or if you choose to attack the creature anyway -­ you must resolve the battle as described below.",
      false,
      "</br>",
      true,
      "First record the creature's <span class='gameStats'>SKILL</span> and <span class='gameStats'>STAMINA</span> scores in the first vacant Monster Encounter box on your *Adventure Sheet*. The scores for each creature are given in the book each time you have an encounter.",
      false,
      "</br>",
      true,
      "The sequence of combat is then: ",
      false,
      "</br>",
      true,
      "1 Roll both dice once for creature. Add its <span class='gameStats'>SKILL</span> score. This total is the creature's *Attack Strength*.",
      false,
      "</br>",
      true,
      "2 Roll both dice once for yourself. Add the number rolled to your current <span class='gameStats'>SKILL</span> score. This total is your *Attack Strength*.",
      false,
      "</br>",
      true,
      "3 If your Attack Strength is higher then that of the creature, you have wounded it. If the creature's *Attack Strength* is higher than yours, it has wounded you. If both *Attack Strength* totals are the same, you have avoided each other's blows -- Start the next Attack Round from step 1 above.",
      false,
      "</br>",
      true,
      "4 If you have wounded the creature, subtract 2 points from its <span class='gameStats'>STAMINA</span> score. You may use your LUCK here to do additional damage (see over).",
      false,
      "</br>",
      true,
      "5 If the creature has wounded you, subtract 2 points from your own <span class='gameStats'>STAMINA</span> score. Again you may use LUCK at this stage (see over).",
      false,
      "</br>",
      true,
      "6 Make the appropriate adjustments to either the creature's or your own <span class='gameStats'>STAMINA</span> scores (and your LUCK score if you used LUCK -- see over).",
      false,
      "</br>",
      true,
      "7 Begin the next *Attack Round* by returning to your current <span class='gameStats'>SKILL</span> score and then repeat steps 1-6.",
      false,
      "</br>",
      true,
      "This sequence continues until the <span class='gameStats'>STAMINA</span> score of either you or the creature you are fighting has been reduced to zero (death).",
      false,
      "</br>",
      false,
      "</br>",
      true,
      "Escaping",
      false,
      "</br>",
      true,
      "On some pages you may be given the option of running away from a battle should things be going badly for you. However, if you do run away, the creature automatically gets in one wound on you (subtract 2 <span class='gameStats'>STAMINA</span> points) as you flee. Such is the price of cowardice. Note that you may use LUCK this on this wound in the normal way (see below) You may only escape if that option is specifically given to you on the page.",
      false,
      "</br>",
      false,
      "</br>",
      true,
      "Fighting More Than One Creature ",
      false,
      "</br>",
      true,
      "If you come across more than one creature in a particular encounter, the instructions on that page will tell you how to handle the battle. Sometimes you will treat them as a single monster; sometimes you will fight each in turn.",
      false,
      "</br>",
      false,
      "</br>",
      true,
      "Luck",
      false,
      "</br>",
      true,
      "At various times during your adventure, either in battles or when you come across situations in which you could either be lucky or unlucky (details of these are given on the pages themselves), you may call on your luck to make the outcome more favourable. But beware! Using luck is a risky business and if you are *un*lucky, the results could be disastrous.",
      false,
      "</br>",
      true,
      "The procedure for using your luck is as follows: roll two dice. If the number rolled is *equal to or less than than* your current LUCK score, you have been *lucky* and the result will go in your favour. If the number rolled is *higher* than your current LUCK score, you have been *unlucky* and you will be penalized.",
      false,
      "</br>",
      true,
      "This procedure is known as *Testing your Luck*. Each time you *Test your Luck*, you must subtract one point from your current LUCK score. Thus you will soon realize that the more you rely on your luck, the more risky this will become.",
      false,
      "</br>",
      true,
      "*Using Luck in Battles*",
      false,
      "</br>",
      true,
      "On certain pages of the book you will be told to *Test your Luck* and will be told the consequences of your being  *lucky* or *unlucky*. However, in battles, you always have the option of using your luck either to inflict a more serious wound on a creature you have just wounded, or to minimize the effects of a wound the creature has just inflicted on you.",
      false,
      "</br>",
      true,
      "If you have just wounded the creature you may *Test your Luck* as described above. If you are *lucky*, you have inflicted a severe wound and may subtract an *extra* 2 points from the creature's <span class='gameStats'>STAMINA</span> score. However, if you are *unlucky*, the wound was a mere graze and you must restore 1 point to the creatures <span class='gameStats'>STAMINA</span> (i.e. instead of scoring the normal 2 points of damage, you have now scored only 1).",
      false,
      "</br>",
      true,
      "If the creature has just wounded you, you may *Test your Luck* to try lo minimize the wound. If you are *lucky*, you have managed to avoid the full damage of the blow. Restore point of <span class='gameStats'>STAMINA</span> (i.e. instead of doing 2 points of damage it has done only 1). lf you are *unlucky* you have taken a more serious blow. Subtract 1 *extra* <span class='gameStats'>STAMINA</span> point.",
      false,
      "</br>",
      true,
      "Remember that you must subtract 1 point from your own LUCK score each time you *Test your Luck*.",
      false,
      "</br>",
      false,
      "</br>",
      true,
      "Restoring Skill, Stamina and Luck",
      false,
      "</br>",
      true,
      "*Skill*",
      false,
      "</br>",
      true,
      "Your <span class='gameStats'>SKILL</span> score will not change much during your adventure. Occasionally, a page may give instructions to increase or decrease your <span class='gameStats'>SKILL</span> score. A Magic Weapon may increase your SKILL, but remember that only one weapon can be used at a time! You cannot claim 2 <span class='gameStats'>SKILL</span> bonuses for carrying two Magic Swords. Your <span class='gameStats'>SKILL</span> score can never exceed its initial value unless specifically instructed. You may only restore your <span class='gameStats'>SKILL</span> score by using a <span class='gameStats'>SKILL</span> Spell (see over).",
      false,
      "</br>",
      true,
      "*STAMINA*",
      false,
      "</br>",
      true,
      "Your <span class='gameStats'>STAMINA</span> score will change a lot during your adventure as you fight creatures and injure yourself. You may only restore your <span class='gameStats'>STAMINA</span> score by Casting a Stamina Spell (see USING MAGIC). You are well advised to ensure that you include several Stamina Spells in your original choice of spells. Remember also that your <span class='gameStats'>STAMINA</span> score may never exceed its *Initial* value.",
      false,
      "</br>",
      true,
      "*Luck*",
      false,
      "</br>",
      true,
      "Additions to your LUCK score may be awarded through the adventure when you have been particularly lucky. Details are given on the pages of the book. Remember that, as with <span class='gameStats'>SKILL</span> and <span class='gameStats'>STAMINA</span> scores, your LUCK score may never exceed its *Initial* value. You may otherwise only restore your LUCK score by using a Luck Spell (see USING MAGIC). ",
      false,
      "</br>",
      false,
      "</br>",
      false,
      "</br>",
      true,
      "USING MAGIC",
      false,
      "</br>",
      false,
      "</br>",
      true,
      "In addition to SKILL, STAMINA, and LUCK scores, you must also determine your MAGIC score in a similar way.",
      false,
      "</br>",
      true,
      "Roll two dice. Add 6 to the number rolled and enter this total in the MAGIC box on your *Adventure Sheet*.",
      false,
      "</br>",
      true,
      "Your MAGIC score determines how many Magic Spells you may use during your quest. These spells may be chosen from the list following this section. After considering the spells available, enter your choices in the Magic Spells box on your Adventure Sheet.",
      false,
      "</br>",
      true,
      "If for example, you roll a 4 and a 3, your your MAGIC score will be 13 (i.e. 1+4+6), which means you will be able to use thirteen spells during your adventure. From the list of spells given below, you may choose thirteen spells as you please. Perhaps you would like to take three Stamina Spells, five E.S.P. Spells, and five Fire Spells -- or maybe you would prefer one of each of the twelve spells plus an extra Creature Copy Spell. The choice is yours.",
      false,
      "</br>",
      true,
      "Each time, during the adventure, that you use a spell, you must cross it off your list (even if it is not effective), if you have taken more than one of any spell, you must reduce the remainder available by one each time you use it. You will sometimes be given the option to use spells and find that you have not got them with you, or have used them all up. In these cases, you may not choose these options.",
      false,
      "</br>",
      true,
      "As you will have no idea of the dangers lurking within the Citadel the first time vou enter, you will no doubt choose spells which will not be as effective as you would like. But on subsequent adventures, you will choose your spells more wisely. Also, don't worry if your MAGIC score is low. Even the lowest possible Score will provide you with enough spells to complete your quest if you make the right choices and are blessed with a little luck!",
      false,
      "</br>",
      false,
      "</br>",
      true,
      "MAGIC SPELLS",
      false,
      "</br>",
      true,
      "*Creature Copy*",
      false,
      "</br>",
      true,
      "This spell will allow you to conjure up an exact duplicate of any creature you are fighting. The duplicate will have the same <span class='gameStats'>SKILL</span> and <span class='gameStats'>STAMINA</span> scores, and the same powers, as its original. But the duplicate will be under the control of your will and you may; for example, instruct it to attack the original creature and then sit back and watch the battle!",
      false,
      "</br>",
      true,
      "*E.S.P*",
      false,
      "</br>",
      true,
      "With this spell you wi11 be able to tune in to psychic wavelengths. It may help you to read a creature's mind or may tell you what is behind a locked door. However; it is sometimes prone to give misleading information if more than one psychic source is close to another.",
      false,
      "</br>",
      true,
      "*Fire*",
      false,
      "</br>",
      true,
      "Every creature is afraid of fire, and this spell allows you to conjure up fire at will. You may cause a small explosion on the ground which will burn for several seconds or you may create a wall of fire to keep creatures at bay. ",
      false,
      "</br>",
      true,
      "*Fool's Gold*",
      false,
      "</br>",
      true,
      "This spell will turn ordinary rock into a pile of what appears to be gold. However, the spell is merely a form of illusion spell -- although more reliable than the Illusion Spell below -- and the pile of gold will soon turn back to rock.",
      false,
      "</br>",
      true,
      "*Illusion*",
      false,
      "</br>",
      true,
      "This is a powerful spell, but one which is a little unreliable. Through this spell you may create a convincing illusion (e.g. that you have turned into a snake or that the floor is covered in hot coals) with which to fool a creature. The spell will immediately be cancelled if anything happens which dispels the illusion (e.g. you convince a creature that you have turned into a snake and then promptly crack it over the head with your sword!). It is most effective against intelligent creatures.",
      false,
      "</br>",
      true,
      "*Levitation*",
      false,
      "</br>",
      true,
      "You may cast this spell onto objects, opponents and even yourself. It frees its receiver from the effects of gravity and as such it will cause that receiver to float freely in the air, under  your control.",
      false,
      "</br>",
      true,
      "*Luck*",
      false,
      "</br>",
      true,
      "This spell, along with <span class='gameStats'>SKILL</span> and Stamina spells, is special in that it may be cast at any time during your adventure, except in battle. You need not wait for a choice to appear on the page. Once cast, it will restore your LUCK score by half your *Initial* LUCK score (if your *Initial* LUCK score is an odd number, deduct the initial 1/2). This spell will never take your LUCK score over its *Initial* level. Thus if you cast two Luck Spells together, your LUCK score will only be restored to its *Initial* level.",
      false,
      "</br>",
      true,
      "*Shielding*",
      false,
      "</br>",
      true,
      "Casting this spell creates an invisible shield in front of you which will protect you from physical objects, e.g. arrows, swords oe creatures. The shield is not effective against magic and, of course, if nothing outside it can touch you, you will not be able to touch anything outside it.",
      false,
      "</br>",
      true,
      "*Skill*",
      false,
      "</br>",
      true,
      "This spell will replenish your <span class='gameStats'>SKILL</span> score by half its *Initial* value, and may be cast at any time during your adventure, except in a battle. For full rules, see the Luck Spell above. The <span class='gameStats'>SKILL</span> Spell works in exactly the same way.",
      false,
      "</br>",
      true,
      "*Stamina*",
      false,
      "</br>",
      true,
      "This spell will replenish your <span class='gameStats'>STAMINA</span> score by half its *Initial* value, and may be cast at any time during your adventure, except in a battle. See the Luck Spell for full rules.",
      false,
      "</br>",
      true,
      "*Strength*",
      false,
      "</br>",
      true,
      "This spell has the effect of increasing your strength greatly and is very useful when battling strong creatures. However, it must be exercised with caution as it is diffucult to control your own strength when it is suddenly increased by so much.",
      false,
      "</br>",
      true,
      "Weakness",
      false,
      "</br>",
      true,
      "Strong creatures are reduced by this spell to miserable weaklings. It is not successful against all creatures, but when effective, those creatures become puny and much less of a challenge in a battle.",
      false,
      "</br>",
      false,
      "</br>",
      false,
      "</br>",
      true,
      "EQUIPMENT",
      false,
      "</br>",
      false,
      "</br>",
      true,
      "You will start your adventure with a bare minimum of equipment. You are armed with a sword and dressed in leather armour. You carry a lantern to light your way and a backpack to hold any treasure or artifacts you may find on your way. Be sure to record all your finds in the Equipment box on your *Adventure Sheet*. When these are used in any particular encounter, the story will tell you weather that item is destroyed or left behind. If it is lost in any way, you must cross it off your list of Equipment and you may not use it later in the adventure.",
      false,
      "</br>",
      true,
      "ADVENTURE SHEET",
      false,
      "</br>",
      false,
      "<a href='https://www.fightingfantasy.com/_files/ugd/29d6b9_1466ca447f3a4ded8c600a3f300fbd0e.pdf' target='_blank'> DOWNLOAD</a>",
      false,
      "</br>",
      false,
      "</br>",
      false,
      "</br>",
      false,
      "</br>",
      true,
      "HISTORY",
      false,
      "</br>",
      true,
      "The lawful goodfolk of the Vale of Willow have lived for some eight years in awe and fear of the demisorcerer Balthus Dire. In awe -- since his power is truly awesome -- and in fear ever since word leaked from his domain that his ambitious plans of conquest were were to commence with the Vale itself.",
      false,
      "</br>",
      true,
      "A faithful half-elf sent on a spying mission to the Black Tower came galloping back to the Vale three days ago with a frantic warning. From within the caverns of Craggen Rock, Balthus Dire had recruited an army of Chaotics and was preparing the1m to attack the Vale within the week.",
      false,
      "</br>",
      true,
      "The good King Salamon was a man of action. Messengers were sent throughout the Vale that day to prepare defenses and to summon the menfolk to action. Riders had also been sent to the Great Forest of Yare to warn the half-elves that lived there and to make an appeal for allied forces. King Salamon was also a wise man. He knew knew well that the new would inevitably reach the Grand Wizard of Yore, a white sorcerer of great power, who lived deep within the forest. The wizard was old, and would not last through a battle of this magnitude. But he schooled a number of young magicians, and perhaps one of his students in the magic arts with courage and ambition would aid the king and his subjects . . .",
      false,
      "</br>",
      true,
      "You are the star pupil of the Grand Wizard of Yore. He has been a difficult master and your own impatience has often gotten the better of you. Perhaps a little too headstrong, you left immediately for Salamon's court. The king welcomed you enthusiastically and explained his plan. The battle could be avoided without bloodshed if Balthus were to be assassinated before his army could be amassed.",
      false,
      "</br>",
      true,
      "The mission ahead of you is extremely perilous. Balthus Dire is surrounded, in his Citadel, by a multitude of appalling creatures. Although Magic is your strongest weapon, there will be times when you must rely on your sword to survive.",
      false,
      "</br>",
      true,
      "King Salamon has briefed you on your mission and warned you of the dangers that lie ahead. One way through the Citadel is the best for you to take. If you discover it, you will be successful with a minimum of personal risk. It may take you several trips to find the easiest way through though.",
      false,
      "</br>",
      true,
      "You leave the Vale of Willow on the long hike to the Black Tower. At the foot of the hill of Craggen Rock, you can see its outline against the dark sky. . . ",
      false,
      "</br>",
      false,
      "Now turn over."
    ]
  },
  {
    "short_name": "",
    "ID": 1,

    "text_array": [
      true,
      "The sun sets. As twilight turns to darkness you start your climb up the hill towards that forbidding shape silhouetted agianst the night sky. The Citadel is less than an hour's climb.",
      false,
      "</br>",
      true,
      "Some distance from its walls you stop to rest - a mistake, as it seems a fearful spectre from which there is no escape. The hairs on your neck prickle as you look towards it.",
      false,
      "</br>",
      true,
      "But you are ashamed of your fears. With grim resolve you march onwards towards the main gate, where you know guards will be waiting. You consider your options. You have already thought about claiming to be a herbalist, come to treat a guard with a fever. You could pose as a trader or an artisan- perhaps a carpenter. You could even be a nomad, seeking shelter for the night.",
      false,
      "</br>",
      true,
      "As you ponder the possibilities, and the yarns you will have to spin to the guards, you reach the main trail leading up to the gates. Two lanterns burn on either side of the portcullis.",
      false,
      "</br>",
      true,
      "You hear muffled gruntings as you approach, and two misshapen creatures step forward. On the left stands an ugly creature with the head of a dog and the body of a great ape, flexing its powerful arms. Its opposite number is indeed its opposite, with the head of an ape on the body of a large dog. This latter guard approaches you on all fours. It stops some metres in front of you, raises itself on its hind legs and addresses you.",
      false,
      "</br>",
      true,
      "Which story will you opt for?",
      false,
      "</br>",
      true,
      "Will you pose as an Herbalist?.............<span class='roomNumber' onclick='clickRoom(261)'>Turn to 261</span>",
      false,
      "</br>",
      true,
      "Will you claim to be a tradesman?..........<span class='roomNumber' onclick='clickRoom(230)'>Turn to 230</span>",
      false,
      "</br>",
      true,
      "Will you ask for shelter for the night?....<span class='roomNumber' onclick='clickRoom(20)'>Turn to 20</span>",
      false,
      "</br>",
      true,
      "",
      false,
      "</br>",
      true,
      ""
    ]
  },
  {
    "short_name": "",
    "ID": 2,

    "text_array": [
      true,
      "A little way up the passage there is a doorway on the right-hand side. This door has some strange scrawlings on it, but they are in a language that you do not understand. Will you try opening the door <span class='roomNumber' onclick='clickRoom(142)'>(turn to 142)</span>, or will you continue up the passage <span class='roomNumber' onclick='clickRoom(343)'>(turn to 343)</span>?"
    ]
  },
  {
    "short_name": "",
    "ID": 3,

    "text_array": [
      true,
      "What will you offer them:",
      false,
      "</br>",
      true,
      "A Pocket Myriad?......................<span class='roomNumber' onclick='clickRoom(327)'>Turn to 327</span>",
      false,
      "</br>",
      true,
      "A Spider in a Jar?....................<span class='roomNumber' onclick='clickRoom(59)'>Turn to 59</span>",
      false,
      "</br>",
      true,
      "A handful of Small Berries?...........<span class='roomNumber' onclick='clickRoom(236)'>Turn to 236</span>",
      false,
      "</br>",
      false,
      "</br>",
      true,
      "If you cannot offer any of these, you can either draw your sword <span class='roomNumber' onclick='clickRoom(286)'>(turn to 286)</span> or head for the far door <span class='roomNumber' onclick='clickRoom(366)'>(turn to 366)</span>."
    ]
  },
  {
    "short_name": "",
    "ID": 4,

    "text_array": [
      true,
      "You conjure up a fireball and send it flying at the creature's face. You watch in dismay as it bounces off with no effect! You may either cast a quick Creature Copy Spell <span class='roomNumber' onclick='clickRoom(190)'>(turn to 190)</span>, or draw your sword <span class='roomNumber' onclick='clickRoom(303)'>(turn to 303)</span>.",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 5,

    "text_array": [
      true,
      "You try the handle of the door and it turns, opening into another hallway. Some distance along, the passageway turns to the right and ends shortly in another door. On this door is a sign, which reads Please Ring for Butler. A rope - evidently the bell - hangs by the door. Will you ring as instructed <span class='roomNumber' onclick='clickRoom(40)'>(turn to 40)</span>, or try the door handle <span class='roomNumber' onclick='clickRoom(361)'>(turn to 361)</span>?",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 6,

    "text_array": [
      true,
      "The path runs alongside the river for several metres and then cuts back into the rock. You follow the path for some time. <span class='roomNumber' onclick='clickRoom(367)'>Turn to 367</span>.",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 7,

    "text_array": [
      true,
      "The door is locked. You may try to break it down by charging it with your shoulder (turn to 268), or you may cast a Strength Spell on yourself and try to wrench the door off its hinges (turn to 116).",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 8,

    "text_array": [
      true,
      "She watches in astonishment as an exact duplicate of herself appears between the two of you. She backs off a little and you instruct your creation to attack. But as they get close to one another, a strange thing happens. They seem unable to get close to one another, like two spinning tops, and keep bouncing apart. But your own copy has at least forced the creature back some distance away from you, allowing you to run to the Citadel's main entrance. Tum to 218.",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 9,

    "text_array": [
      true,
      "Under your Illusion Spell, the crowd of onlookers see you start playing the game. You watch for a couple of rounds and the tension mounts. You decide it prudent to leave the room without wasting more time. <span class='roomNumber' onclick='clickRoom(31)'>Turn to 31</span>.",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 10,

    "text_array": [
      true,
      "You feel around in the rock and eventually find a small lever. As you pull this lever, the rock face crumbles slightly and a narrow opening appears. You climb through this opening and find yourself in a passageway. Down the passageway to the left you can see a door and decide to investigate. Turn to 249.",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 11,

    "text_array": [
      true,
      "You may use either:",
      false,
      "</br>",
      true,
      "A Fool's Gold Spell Turn to 36",
      false,
      "</br>",
      true,
      "A Creature Copy Spell Turn to 262 ",
      false,
      "</br>",
      true,
      "An E.S.P. Spell Turn to 128",
      false,
      "</br>",
      true,
      "A Weakness Spell Turn to 152",
      false,
      "</br>",
      true,
      "If you have none of these, you will have to draw your sword and fight (turn to 16).",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 12,

    "text_array": [
      true,
      "He stands in front of you breathing heavily. His Spell was evidently quite exhausting. You may use this as an opportunity to:",
      false,
      "</br>",
      true,
      "Nip over to the armoury cupboard Turn to 274",
      false,
      "</br>",
      true,
      "Spring under the table Turn to 335",
      false,
      "</br>",
      true,
      "Rush to the window Turn to 78",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 13,

    "text_array": [
      true,
      "The handle turns and you open the door into another room, where there is plenty of activity. Three ugly old women with long noses and chins are scooting around the room-which seems to be a kitchen of some sort taking various ingredients from the cupboards and adding them to a broth in a large kettle. There is a joint of meat roasting on a spit under a large chimney. As you look more carefully you can tell that the meat is not, in fact, an animal, but a whole Dwarf, turning black in the fire. One of the women glances at you and says, 'Ah, you must be the new servant... or are you the next meal?' whereupon they all begin to cackle and shriek with laughter. Will you let them believe you are the new servant they are expecting (turn to 302), or do you want to investigate the room further (turn to 215)?",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 14,

    "text_array": [
      true,
      "The shadow of the wall makes it very difficult to see. A loose stone slips and you lose your balance, teetering on the edge of what you realize must be a deep pit. Test your Luck. If you are Lucky, you regain your footing and step back to safety. You can then walk round the pit and continue (turn to 79). If you are Unlucky, you fall in (turn to 100).",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 15,

    "text_array": [
      true,
      "The dagger is indeed a work of art and was undoubtedly worth a fair price. The blade is made of shiny metal and the hill is a peculiar green leather, with inlaid stones. You read an inscription which tells you that it is an enchanted throwing dagger which never misses. In a future combat, you may use this dagger to throw at an opponent. It will automatically inflict 2 STAMINA points of damage without the need to roll for Attack Strength. But you may use it only once. You put the dagger into your belt and set off towards the Citadel. Turn to 245.",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "- Battle",
    "ID": 16,

    "text_array": [
      true,
      "Resolve your battle:",
      false,
      "</br>",
      true,
      "GARK - - - - - - SKILL 7 - - - - - - STAMINA 11",
      false,
      "</br>",
      true,
      "After four Attack Rounds, you may Escape through one of the doors at the far end of the room (turn to 99). If you wish to continue the battle, do so and turn to 180 if you win.",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 17,

    "text_array": [
      true,
      "All manner of strange foodstuffs are in the cup- boards. Eyeballs, tongues, small lizards, vials of liquids, herbs and berries of all different shapes and sizes. One particular bottle, of a translucent green liquid, catches your eye. You have no time to read the label there and then, so you put it quickly into your pocket while they are not looking. You tell them that their kitchen appears to be in order and leave through the door at the far end of the kitchen. Turn to 93.",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 18,

    "text_array": [
      true,
      "He points to a section just above the floor, which you peruse. Eventually you choose one volume and settle down to read through it. Balthus Dire is apparently third in a line of Sorcerer-Warlords ruling over the Black Tower and the Kingdom of Craggen Rock. He rose to power after the death of his father, Craggen Dire, some years ago. The Dires have been masters of Black Sorcery for generations, but their strength and power last during the night- time only; sunlight is like a poison to them. Shortly after his father's death, Balthus Dire married the Lady Lucretia, herself a Black Sorceress, and since that time they have ruled together over the King- dom of Craggen Rock. As you finish the book, you notice that the librarian is holding his hand to his ear, apparently listening to something. He glances up at you, quizzically. You may either look for another useful book which may aid you on your quest (turn to 84), or attempt to leave the library through the door behind him (turn to 31).",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 19,

    "text_array": [
      true,
      "The staircase creaks as your foot falls on it. You try to ascend as quietly as possible, but the old timbers groan under your weight. Suddenly one of the stairs clicks as if to trigger a switch of some kind. To your surprise, all of the stairs flick downwards! You are now standing on a smooth, steep slope! Try as you might, you cannot keep your balance and you fall down the slope, tumbling head-over-heels. If you wish to use a Levitation Spell, you may fly up and out of danger, to land on the balcony above (turn to 363); otherwise turn to 254.",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 20,

    "text_array": [
      true,
      "The Ape-Dog tells you that no one is allowed into the Black Tower after dark - you will have to look elsewhere for shelter. You may either resign your self to a fight (turn to 288). Or you may pick up a stone and cast a Fool's Gold Spell on it, offering them a nugget of gold as a bribe to let you in (turn to 96). Deduct the Fool's Gold Spell from your Spells if you use it.",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 21,

    "text_array": [
      true,
      "What brings you to these parts?' she demands. You tell her your story, carefully avoiding telling her of your real mission. She advises that if you know any magic, you should flee from this place. The creatures you have met so far do not compare with those you will come across within the Citadel Tower itself. She tells you you will never meet the master without finding the Fleece first, and bids you luck on your mission. Add 2 LUCK points for the information you have learned and set off onwards. Turn to 6.",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 22,

    "text_array": [
      true,
      "You open the door and step out into a long, dark corridor. Turn to 188.",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 23,

    "text_array": [
      true,
      "You open the door and step out into a passageway which continues straight onwards for some time. It swings to the left, then back to the right, until you can see an archway ahead that opens out into a large room. You head forwards into the room. Turn to 169.",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 24,

    "text_array": [
      true,
      "You taste the wine and, as you are considering its flavour, you hear a clinking noise. You turn to look in the direction that the noise is coming from and you are horrified to see that the bottles in the racks are moving on their own. One bottle flies from its place and hurtles towards you, narrowly missing your head and smashing on the wall behind you. Another flies at you, then another, until you are being pelted by bottles from all directions. You realize that your unly defence is to use a Shielding Spell. Cast this Spell if you can and turn to 372. If you cannot cast this Spell, turn to 219.",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 25,

    "text_array": [
      true,
      "The door opens, allowing you into a large, circular room. You scratch your head quizzically. In the centre of the room you can see a small island', surrounded by a wide trench, on which stands a chest, locked with metal fastenings. The trench is too wide to jump and is very deep. Just inside the door is a length of rope. A door leads from the room, opposite the door you came in through. Will you:",
      false,
      "</br>",
      true,
      "Ignore the box and walk round the trench to the other door? Turn to 206",
      false,
      "</br>",
      true,
      "Cast a Strength Spell and leap across the trench? Turn to 133",
      false,
      "</br>",
      true,
      "Pick up the rope and formulate a plan? Turn to 239"
    ]
  },
  {
    "short_name": "",
    "ID": 26,

    "text_array": [
      true,
      "Will you cast:",
      false,
      "</br>",
      true,
      "A Fire Spell? Turn to 87",
      false,
      "</br>",
      true,
      "A Weakness Spell? Turn to 345",
      false,
      "</br>",
      true,
      "A Creature Copy Spell? Turn to 101",
      false,
      "</br>",
      true,
      "If you have none of these, return to 304 and choose again.",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 27,

    "text_array": [
      true,
      "As you hold out the Gold Pieces, the three creatures stop in their tracks. They gasp as they look at your coins. An invisible hand snatches them from you and lays them on the ground. They look at you and a voice demands more. You pull out all your Gold Pieces and throw them into the centre of the room. A voice rings out: 'Well, stranger, you are indeed welcome here in the house of the MIKS. We thank you for your gift. If you are heading on, take the door ahead of you, but beware of the Canjees. We wish you luck with your journey. You may add one LUCK point for the Miks' good wishes, and leave through the door ahead of you. Turn to 206.",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 28,

    "text_array": [
      true,
      "You cast the Spell and conjure up a ball of fire in your hands. They stop in their tracks and watch you carefully. You toss the ball towards them and they shriek in fright, rolling away in terror from your obvious powers. While you still have control over the Spell, you create three smaller fireballs and pitch one at each of them. They howl and scatter, rolling up the corridor away from you. You may now proceed up the left-hand passageway (turn to 243). or up the right hand passageway (turn to 2).",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 29,

    "text_array": [
      true,
      "Cautiously, you approach the little man. As you get close, a single eye opens and looks you straight in the face. A wide grin spreads between the creature's cars and he disappears! 'Good mornin' to yer!' says a chirpy little voice behind you, and you swivel round to see him standing there, still grinning. I'm O'Seamus, the Leprechaun!' he chuckles, and holds his hand out to you. He seems friendly enough - will you shake his hand and try to befriend him (turn to 271), or draw your sword (turn to 131)?",
      false,
      "</br>"
    ]
  },
  {
    "short_name": " - Battle",
    "ID": 30,

    "text_array": [
      true,
      "The beast is immensely powerful. You draw your Sword and the battle starts:",
      false,
      "</br>",
      true,
      "CLAWBEAST - - - - - SKILL 9 - - - - - STAMINA 14",
      false,
      "</br>",
      true,
      "When you have inflicted your fourth hit on the creature, turn to 241.",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 31,

    "text_array": [
      true,
      "You leave the room through the door at the far end, which opens into a short passageway ending at a large wooden door. The handle on this door turns, letting you into a large chamber. Turn to 169.",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 32,

    "text_array": [
      true,
      "Stepping over the bodies, you approach the gate and call for the gatekeeper, hiding in the shadows as he approaches. He sees the bodies and comes out to investigate, whereupon you nip inside the gate and lock him out. Turn to 251.",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 33,

    "text_array": [
      true,
      "As you try to rise, the Orc and the Goblin grab you and hold you down, while the Dwari advances with his club. Turn to 213.",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 34,

    "text_array": [
      true,
      "The key turns and, removing the lock, you open the box to find another key, this time cut in a glowing green metal. Will you try this new key on the third box (turn to 89) or leave the room with the two keys (turn to 237)?",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 35,

    "text_array": [
      true,
      "You concentrate on your Illusion. You can either convince him that he is being attacked by an enemy (turn to 364), or make yourself disappear in the hope that he will come looking for you (turn to 246).",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 36,

    "text_array": [
      true,
      "'Pah!' says the Gark, 'I do not fool that easily. Throw your lumps of brass away.' It dawns on the creature that, if you are offering a bribe, you must be an intruder which for a Gark - is quite a stunning - piece of logical thinking! It slaps you hard with its great hand, knocking you unconscious onto the floor. The last words you hear before you pass out are the proud Gark's: 'Into the jail for this one! Turn to 234. And don't forget to deduct your wasted Fool's Gold Spell.",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 37,

    "text_array": [
      true,
      "You draw out the skin and the creature hisses loudly. All its heads retreat and it remains still, watching you. There is a door on the far side of the room and you slowly make your way towards it. Halfway across the room, a head darts out and snatches the fleece from your hands. But instead of attacking you, the Hydra slinks back into a corner. You move on to the door cautiously. Turn to 229.",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 38,

    "text_array": [
      true,
      "The door opens into a short passageway which is paved with small stones. A short distance further on, an ornately carved door marks the end of the passageway. But just before the door, a side passage leads off to the left. You approach the door, listening for any signs of life inside. As your hand touches the handle, a voice says: 'Do not knock; just enter!' from inside. Will you enter the room as instructed (turn to 132) or will you decide against this room and take the passage leading off to the left (turn to 306)?",
      false,
      "</br>"
    ]
  },
  {
    "short_name": " - Battle",
    "ID": 39,

    "text_array": [
      true,
      "You take out the Jar and, as you do so, the Ganjees gasp. 'Racknee!' says a voice. 'You have returned!' And with those words, an invisible hand snatches the jar from you, lays it onto the ground and opens the lid. The Spider-Man turns towards you and growls a little growl. You draw your sword as the beast scuttles towards you angrily. You must fight the creature:",
      false,
      "</br>",
      true,
      "SPIDER-MAN SKILL 7 STAMINA 5",
      false,
      "</br>",
      true,
      "As soon as the Spider-Man gets its first hit on you, turn to 208. If you win without it wounding you, you must now face the Ganjees with your sword. Tum to 248."
    ]
  },
  {
    "short_name": "",
    "ID": 40,

    "text_array": [
      true,
      "After several moments the door opens slowly and a hunchbacked, misshapen creature with rotten teeth, ragged hair and tattered clothes stands in front of you. 'Yes, sir (heh, heh) - what can I do for you? growls the half-human creature. 'I am expected, you reply, and walk past him through the door with confidence. He is a little bewildered by your manner and stammers, not knowing whether to challenge you or not. Which way to the reception room? you demand. He squints at you through one eye and motions towards a left fork in the passage- way a short distance ahead. Will you believe him and take the left fork (turn to 243), or do you distrust this shifty creature and take the right fork (turn to 2)?",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 41,

    "text_array": [
      true,
      "The three women shuffle together in a huddle and mutter under their breath to one another. With a little chuckle, one of them turns to you and says, 'Yes, stranger, we'll help you on your way.' She fixes you with ice-cold eyes, and points her finger first at you, then at the wall behind her. The room goes dark, you feel a rushing sensation and, when the darkness clears, you are in another room. Turn to 257-",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 42,

    "text_array": [
      true,
      "She blinks and the jets of fire disappear. What will you offer her?:",
      false,
      "</br>",
      true,
      "A Silver Mirror? Turn to 138",
      false,
      "</br>",
      true,
      "A Hairbrush? Turn to 91",
      false,
      "</br>",
      true,
      "A Jar containing a Spider-Man? Turn to 223",
      false,
      "</br>",
      true,
      "If you have none of these, you must make some excuse about losing your gift and go back onto the balcony where you may take either the middle door (turn to 64) or the far door (turn to 304).",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 43,

    "text_array": [
      true,
      "As you cast the spell, his grip loosens. Gradually his strength ebbs until eventually he releases his grip and slumps back, panting, on the ground. Lose 1 more STAMINA point as you nurse your wounded arm, and cross the Weakness Spell off your list. You can continue on your way. Turn to 14.",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 44,

    "text_array": [
      true,
      "The room stops shaking and you drop to the ground. The armoury cupboard is locked, but you may smash the lock. Or you may take off your backpack and look for a weapon to use. Which will you do:",
      false,
      "</br>",
      true,
      "Choose a weapon from the cupboard? Turn to 353",
      false,
      "</br>",
      true,
      "Take an artefact from your backpack? Turn to 277",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 45,

    "text_array": [
      true,
      "If your stomach will bear it, you may try:",
      false,
      "</br>",
      true,
      "Some of the meat hanging up Turn to 166 ",
      false,
      "</br>",
      true,
      "A piece of fruit Turn to 313",
      false,
      "</br>",
      true,
      "A slice of cheese Turn to 253",
      false,
      "</br>",
      true,
      "A loaf of bread Turn to 97",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 46,

    "text_array": [
      true,
      "With a motion, you fling your hand forward and point to the floor beneath the sorcerer. Smoke and flames burst from the ground. Balthus Dire jumps back a little, startled, then closes his eyes to concen- trate. As they open, you can see a fire burning within the pupils themselves, and he steps forward into the flame you created. Taking a handful of flaming rubble, he throws this at you. Will you duck to avoid it (turn to 195), or jump out of the way (turn to 74)?",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 47,

    "text_array": [
      true,
      "What Spell will you use:",
      false,
      "</br>",
      true,
      "Creature Copy Spell? Turn to 8",
      false,
      "</br>",
      true,
      "Illusion Spell? Turn to 173",
      false,
      "</br>",
      true,
      "Levitation Spell?Turn to 259",
      false,
      "</br>",
      true,
      "If you have none of these spells, you will have to retreat towards the monument in the centre of the courtyard and hide from her (turn to 209).",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 48,

    "text_array": [
      true,
      "'Never!' screams the sorcerer, spinning round from the shadows to face you. This time it is you who feels the quake of fear as you see that he has also changed himself - but into a creature which may cause a Fire Demon to stop in its tracks. Balthus Dire's face has become ugly and witch-like and his hair now seethes and squirms with small, hissing snakes. Will you retreat from this creature (turn to 232) or leap forward with your Trident (turn to 199)?",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 49,

    "text_array": [
      true,
      "The creature gazes at you quizzically as if it is uncertain about you. Turn to 255.",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 50,

    "text_array": [true, "Turn to 164.", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 51,

    "text_array": [
      true,
      "You slash about madly with your sword but cannot hit the creature. Either it is extremely quick, or it has no solid body for you to hit! Its teeth are now tearing at your flesh and you can feel blood on your leg. You will have to protect yourself with your magic, or face certain death from this unseen creature. Will you cast a Strength Spell (turn to 301), a Weakness Spell (turn to 159), or, if you cannot or will not cast either. turn to 280.",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 52,

    "text_array": [
      true,
      "The door opens and you stride onwards, slamming it shut behind you. A short distance ahead, you reach a three-way junction, where you take the northwards passage. This continues for several metres leading to another door. You can hear laugh- ter and merriment on the other side. Cautiously you open the door into a large room where a party of a dozen or so creatures, of all shapes, sizes and colours, are playing games. As you step into the room, a voice shouts, Look, this must be Glaz-Doz- Fut!' whereupon they all welcome you, inviting you to join the fun. Evidently they are expecting some one and have mistaken you for their missing guest. Will you play along and join them (turn to 385), or will you tell them they are mistaken and try to make your way over to the door on the other side of the room (turn to 227)?",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 53,

    "text_array": [
      true,
      "What do I want with your berries?' she laughs. 'My appetite died with my body! And as you look closer you can see that she too is nothing but a Chost. She floats across in the air towards you. Turn to 194.",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 54,

    "text_array": [
      true,
      "You search through your backpack. What will you pull out:",
      false,
      "</br>",
      true,
      "A Jar of Ointment? Turn to 287",
      false,
      "</br>",
      true,
      "A Pocket Myriad? Turn to 160",
      false,
      "</br>",
      true,
      "Gold Pieces? Turn to 27",
      false,
      "</br>",
      true,
      "If you have none of these, you will have to return to 104 and choose again."
    ]
  },
  {
    "short_name": "",
    "ID": 55,

    "text_array": [
      true,
      "You follow the passageway for some time. It turns to the right and eventually reaches a dead end. You may either return to the fork and take the other passage (turn to 249) or you may look for secret passages (turn to 10).",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 56,

    "text_array": [
      true,
      "The BLACK ELF approaching you is skinny and ragged. He asks whether you are aguest or an adventurer. You tell him you are a guest, come down to sample the wine he keeps in his famous Wine Cellar. With a certain pride, he shows you the vintage bottles he keeps for his Lord, the Demi- Sorcerer. Some of them, he claims, have magical powers. He offers to let you sample the wine. Will you try a sample of:",
      false,
      "</br>",
      true,
      "The Red Wine? Turn to 120",
      false,
      "</br>",
      true,
      "The White Wine? Turn to 163",
      false,
      "</br>",
      true,
      "The Rosé Wine? Turn to 334",
      false,
      "</br>",
      true,
      "Decline his offer and make your way onwards? Turn to 95"
    ]
  },
  {
    "short_name": "",
    "ID": 57,

    "text_array": [
      true,
      "Test your Luck. If you are Lucky, turn to 150. If you are Unlucky, hurn to 233.",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 58,

    "text_array": [
      true,
      "As you enter, the Gremlins flutter and squeak excitedly, then fly past you,through the door and out into the night. You are now alone with the chalices. Will you risk taking a drink? If so, will you choose:",
      false,
      "</br>",
      true,
      "The clear liquid? Turn to 298",
      false,
      "</br>",
      true,
      "The red liquid? Turn to 267",
      false,
      "</br>",
      true,
      "The milky liquid? Turn to 92",
      false,
      "</br>",
      true,
      "Or will you leave and head for the Citadel (turn to 156)?"
    ]
  },
  {
    "short_name": "",
    "ID": 59,

    "text_array": [
      true,
      "They are revolted by your gift and run over to the corner of the room, hiding under the beds. Some what puzzled by their behaviour, you leave the Jar on the floor and make for the door on the far side of the room. Turn to 140.",
      true,
      "Levitation Spell  Turn to 33",
      false,
      "</br>",
      true,
      "Illusion Spell Turn to 295",
      false,
      "</br>",
      true,
      "Or you may draw your sword and fight (turn to 213)."
    ]
  },
  {
    "short_name": "",
    "ID": 60,

    "text_array": [
      true,
      "The creatures become suspicious as you press them for information. The Dwarf springs to his feet bran- dishing a wooden club, while the Goblin and the Orc grab swords and glare at you. The Goblin's mistress shrieks and steps back several paces as the others advance towards you. You will have to fight them. You may use a Magic Spell:",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 61,

    "text_array": [
      true,
      "You advance with your sword. The Devlin stops ...then springs at you! You slash with your sword but cannot harm the creature, which is now on top of you. Its flaming body is burning your flesh and you are in agony. Still it holds on and you pass out in shock. You fall to the ground never to wake again as the Devlin makes sure that your body is scorched beyond recovery. You will, after all, be the next meal for the creatures of the Black Tower . . .",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 62,

    "text_array": [
      true,
      "With the Gargoyle out of action, you decide to investigate the box in the creature's pedestal. Test your Luck. If you are Lucky, you may take the pouch of 10 Gold Pieces locked inside. If you are Unlucky, you do not manage to open the box. Leave the room by turning to 140.",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 63,

    "text_array": [
      true,
      "You turn to the index and look up the reference. Turning to the correct page, you are dismayed to find that the section has been ripped out of the book! You may either turn to the Calacorns (turn to 263), or look up the Miks (turn to 135).",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 64,

    "text_array": [
      true,
      "You listen at the door and can hear squeaky voices laughing and squabbling. You try the handle and the door opens. Inside is a brightly coloured room. A few small beds are in one corner, and strewn about the floor are small mannequins of various brutish creatures. Along the right-hand wall is a large box and just beyond the box is a door. In the centre of the floor, and looking up at you quizzical- ly, are three small creatures. They are human-like but have green skin, pointed ears and slit-like eyes. What will your approach be? Will you:",
      true,
      "Draw your sword and prepare to fight them? Turn to 286",
      false,
      "</br>",
      true,
      "Look in your pack for something to offer them? Turn to 3",
      false,
      "</br>",
      true,
      "Walk confidently across the room to the far door? Turn to 366"
    ]
  },
  {
    "short_name": "",
    "ID": 65,

    "text_array": [
      true,
      "You kneel before him and bow. He is indeed your master now. You have failed in your mission.",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 66,

    "text_array": [
      true,
      "They look at each other and chatter. One steps forward and holds out a small cube which looks as though it has been made of some kind of bread or cake. At his request, you pop it into your mouth and chew it. As you swallow it, you feel suddenly strong again. Restore your SKILL. and STAMINA Scores to their Initial levels and add 1 LUCK point. You thank him for the food, thank them all for their company and head for the doors. Turn to 270.",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 67,

    "text_array": [
      true,
      "You begin your fight with the creature. Your first blow is lucky and severs one of its six heads. The other five strike at you and, to your horror, two more heads grow where the other one died! One of the heads bites deep into your arm. Lose 4 STAMINA points. Your sword is obviously going to be of little use. Will you use a Creature Copy Spell (turn to 143) or something from your backpack (turn to 226)?",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 68,

    "text_array": [
      true,
      "'Which would I take, eh?' he muses. Let's see...I would not take the one two doors to the left of the copper-handled one, nor the door to the right of the bronze-handled one.' Which one will you choose:",
      true,
      "The brass-handled door? Turn to 207",
      false,
      "</br>",
      true,
      "The copper-handled door? Turn to 22",
      false,
      "</br>",
      true,
      "The bronze-handled one? Turn to 354"
    ]
  },
  {
    "short_name": "",
    "ID": 69,

    "text_array": [
      true,
      "The creature is not very talkative, but you do dis- cover that you are in the dungeons beneath the Black Tower and you will probably never be re- leased, unless you are given to the Ganjees for sport. When you question him about Balthus Dire, he goes silent. You had better try a Spell to get you out of this prison. Turn to 193.",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 70,

    "text_array": [
      true,
      "You fly up and away from his lunges but he stands his ground and there is no way for you to fly around him to the door. Eventually the Spell wears off and you must face him once again. Will you:",
      true,
      "Use a Weakness Spell? Turn to 307",
      false,
      "</br>",
      true,
      "Use a Strength Spell? Turn to 264",
      false,
      "</br>",
      true,
      "Draw your sword? Turn to 325",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 71,

    "text_array": [
      true,
      "You draw your sword and hack at the tentacle. The tentacle will not fight back as will a normal creature, but instead is trying to drag you into a large hole in the ground which is opening around its base. You do not need to roll for the tentacle, as it has an Attack Strength of 15 and a STAMINA Score of 2. Throw for combat in the normal way, but if your own Attack Strength comes to less than 15, do not subtract any points from your own STAMINA. However, if you do not defeat the creature within 3 Attack Rounds, it succeeds in dragging you into its lair and your adventure is over. If you do defeat it, you can peel the tentacle off your leg and proceed to the main entrance to the Black Tower. Turn to 218.",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 72,

    "text_array": [
      true,
      "Luck is not with you. Your first glance at the ser- pent-headed creature was enough to scal your fate. You cry out in anguish as you feel your joints begin to seize and your limbs become heavy and uncontrollable. As the Gorgon's stony stare takes effect, you fight for balance - but lose it and crash to the floor. Your petrified body cracks on impact and you now lie in several pieces before Balthus Dire. You have failed in your mission.",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 73,

    "text_array": [
      true,
      "Either you may try to cut yourself free from the Sewer Snake, or you may wardit off with a Spell. If has you will fight the creature, resolve this battle:",
      false,
      "</br>",
      true,
      "SEWER SNAKE SKILL 6 STAMINA 7",
      false,
      "</br>",
      true,
      "If you win, turn to 112.",
      false,
      "</br>",
      true,
      "If you wish to cast a Strength Spell, add 3 to your dice roll on your AttackStrength. If you wish to cast a Fire Spell, turn to 282.",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 74,

    "text_array": [
      true,
      "As you jump to the side, the sorcerer's eyes follow you and so does his fireball! It hits you in the chest, knocking you over. The scorching will cost you STAMINA points. If you are still alive, you may prepare another Spell for your counter-attack. Turn to 377-",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 75,

    "text_array": [
      true,
      "You step through the doorway, close the door be hind you and wait for some time. You hear the footsteps run closer and reach the door. Incomprehensible chatterings on the other side of the door eventually die down and again you hear footsteps, this time moving away from you. You ring for the butler. Turn to 40.",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 76,

    "text_array": [
      true,
      "While you were pulling out your Berries, Balthus Dire has been concentrating on a Spell. He looks up and bursts out laughing. Slumberberries!' he cries. 'And what are you expecting me to do? Pop them into my mouth?' He snaps his fingers and his Spell materializes. Turn to 191.",
      false,
      "</br>"
    ]
  },
  {
    "short_name": "",
    "ID": 77,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 78,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 79,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 80,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 81,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 82,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 83,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 84,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 85,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 86,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 87,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 88,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 89,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 90,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 91,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 92,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 93,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 94,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 95,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 96,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 97,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 98,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 99,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 100,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 101,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 102,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 103,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 104,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 105,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 106,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 107,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 108,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 109,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 110,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 111,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 112,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 113,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 114,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 115,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 116,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 117,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 118,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 119,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 120,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 121,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 122,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 123,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 124,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 125,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 126,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 127,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 128,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 129,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 130,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 131,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 132,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 133,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 134,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 135,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 136,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 137,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 138,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 139,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 140,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 141,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 142,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 143,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 144,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 145,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 146,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 147,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 148,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 149,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 150,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 151,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 152,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 153,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 154,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 155,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 156,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 157,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 158,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 159,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 160,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 161,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 162,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 163,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 164,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 165,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 166,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 167,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 168,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 169,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 170,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 171,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 172,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 173,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 174,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 175,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 176,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 177,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 178,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 179,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 180,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 181,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 182,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 183,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 184,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 185,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 186,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 187,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 188,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 189,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 190,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 191,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 192,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 193,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 194,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 195,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 196,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 197,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 198,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 199,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 200,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 201,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 202,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 203,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 204,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 205,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 206,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 207,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 208,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 209,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 210,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 211,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 212,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 213,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 214,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 215,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 216,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 217,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 218,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 219,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 220,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 221,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 222,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 223,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 224,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 225,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 226,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 227,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 228,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 229,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 230,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 231,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 232,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 233,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 234,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 235,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 236,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 237,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 238,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 239,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 240,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 241,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 242,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 243,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 244,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 245,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 246,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 247,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 248,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 249,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 250,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 251,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 252,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 253,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 254,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 255,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 256,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 257,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 258,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 259,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 260,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 261,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 262,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 263,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 264,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 265,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 266,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 267,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 268,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 269,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 270,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 271,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 272,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 273,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 274,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 275,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 276,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 277,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 278,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 279,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 280,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 281,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 282,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 283,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 284,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 285,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 286,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 287,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 288,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 289,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 290,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 291,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 292,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 293,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 294,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 295,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 296,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 297,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 298,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 299,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 300,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 301,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 302,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 303,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 304,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 305,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 306,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 307,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 308,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 309,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 310,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 311,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 312,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 313,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 314,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 315,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 316,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 317,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 318,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 319,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 320,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 321,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 322,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 323,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 324,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 325,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 326,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 327,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 328,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 329,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 330,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 331,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 332,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 333,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 334,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 335,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 336,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 337,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 338,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 339,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 340,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 341,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 342,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 343,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 344,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 345,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 346,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 347,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 348,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 349,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 350,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 351,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 352,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 353,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 354,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 355,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 356,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 357,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 358,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 359,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 360,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 361,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 362,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 363,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 364,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 365,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 366,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 367,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 368,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 369,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 370,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 371,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 372,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 373,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 374,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 375,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 376,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 377,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 378,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 379,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 380,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 381,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 382,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 383,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 384,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 385,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 386,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 387,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 388,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 389,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 390,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 391,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 392,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 393,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 394,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 395,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 396,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 397,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 398,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 399,

    "text_array": [true, "", false, "</br>"]
  },
  {
    "short_name": "",
    "ID": 400,

    "text_array": [true, "", false, "</br>"]
  }
]
